app/controllers/api/v1/spaces_controller.rb

SELECT `spaces`.* FROM `spaces`
---
  def index
    @spaces = Space.all